# Taps
tap "homebrew/cask"
tap "derailed/k9s"

# ============================================
# CLI Tools
# ============================================

# Shell & Terminal
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "stow"

# Modern CLI Replacements
brew "bat"                    # better cat
brew "eza"                    # better ls
brew "fd"                     # better find
brew "ripgrep"                # better grep
brew "zoxide"                 # better cd
brew "fzf"                    # fuzzy finder
brew "delta"                  # better git diff
brew "tldr"                   # simplified man pages
brew "htop"                   # better top

# Git & Version Control
brew "git"
brew "lazygit"
brew "gh"

# Editor
brew "neovim"

# DevOps & Cloud
brew "awscli"
brew "docker"
brew "docker-compose"
brew "helm"
brew "kubernetes-cli"
brew "k9s"
brew "terraform"

# Build & Languages
brew "maven"
brew "node"
brew "nvm"
brew "python@3"
brew "go"
brew "rust"

# Data & JSON
brew "jq"
brew "yq"

# Networking & Misc
brew "curl"
brew "wget"
brew "tree"
brew "coreutils"
brew "gnupg"
brew "shellcheck"

# ============================================
# GUI Applications (macOS Casks)
# ============================================
cask "iterm2"
cask "docker"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "rectangle"
cask "1password"
cask "slack"
cask "notion"
cask "brave-browser"
cask "postman"
